{
  "workExperience": [
    {
      "title": "Research Finance Analyst",
      "company": "Office of Research, Scholarships and Community Engagement, Mount Royal University",
      "location": "Calgary, AB",
      "years": "Jan 2024 – Present",
      "responsibilities": [
        "Review and process approvals for research-related expenses, payment requisitions, research assistant payroll, fund transfers/corrections, and vendor contracts, ensuring compliance with internal policies and external funding requirements.",
        "Monitor revenue and expenditures across 100+ active research fund accounts, providing financial oversight, resolving discrepancies, and offering guidance to faculty researchers.",
        "Assess existing procedures and recommend improvements to strengthen internal controls and streamline financial operations.",
        "Support budget planning initiatives for the ORSCE office, faculty, and institutional research projects; generate detailed financial reports for externally funded initiatives.",
        "Develop and deliver training sessions for faculty and staff to enhance understanding of financial processes and compliance expectations.",
        "Serve as a key resource for faculty on research hiring, professional services contracting, and related financial procedures."
      ]
    },
    {
      "title": "Program Assistant, Experience Ventures - Casual",
      "company": "Hunter Hub for Entrepreneurial Thinking, University of Calgary",
      "location": "Calgary, AB",
      "years": "Jan 2024 – May 2024",
      "responsibilities": [
        "Finalized contract amendments related to funding and placement allocations for partner post-secondary institutions.",
        "Consolidated placement data from network partners and prepared comprehensive year-end reports using Campus Connect."
      ]
    },
    {
      "title": "Operations Coordinator",
      "company": "Hunter Hub for Entrepreneurial Thinking, University of Calgary",
      "location": "Calgary, AB",
      "years": "Oct 2022 – Jan 2024",
      "responsibilities": [
        "Prepared quarterly and year-end financial reconciliations and reports for both Hunter Hub operations and government-funded I-WIL Ventures project.",
        "Oversaw research fund transactions, processed journal entry corrections, salary recoveries and internal fund transfers.",
        "Handled financial operations, including payment requests, PO requisitions, scholarship disbursements, honoraria, employee payments, and expense reimbursements.",
        "Designed and implemented internal finance workflows for departmental programs, serving as a finance resource for students, researchers, and startups.",
        "Fostered collaboration with internal departments (research accounting, procurement, payroll, etc.) and external partners including post-secondary institutions and vendors.",
        "Served as Acting Executive Assistant to the Executive Director for four months, providing senior-level administrative support and contributing to strategic partnerships and HR activities."
      ]
    },
    {
      "title": "Administrative and Events Assistant",
      "company": "Hunter Hub for Entrepreneurial Thinking, University of Calgary",
      "location": "Calgary, AB",
      "years": "Apr 2022 – Oct 2022",
      "responsibilities": [
        "Executed financial processes such as expense tracking, card reconciliations, requisitions, and scholarship disbursements via PeopleSoft.",
        "Drafted contracts and acted as liaison for sponsorship and partnership initiatives.",
        "Managed the Salesforce database, central inbox, and space bookings.",
        "Provided logistical and administrative support for core programs, including Experience Ventures, TENET i2c, and Launchpad."
      ]
    },
    {
      "title": "Administrative Assistant - Short Term Placement",
      "company": "Faculty of Social Work, University of Calgary",
      "location": "Calgary, AB",
      "years": "Jan 2022 – Mar 2022",
      "responsibilities": [
        "Performed general office administration, managed Outlook calendars, and supported project tracking in Asana.",
        "Conducted research and synthesized findings related to domestic violence studies.",
        "Developed a social media marketing plan and supported website content creation for the Shift e-learning platform.",
        "Contributed to account management, business planning, and market research for commercialization strategies."
      ]
    },
    {
      "title": "Business Analyst",
      "company": "Smartlink Card Services JSC",
      "location": "Hanoi, Vietnam",
      "years": "Oct 2014 – May 2015",
      "responsibilities": [
        "Created four marketing proposals for airline and telecom clients, including performance analysis and budget plans.",
        "Initiated media and business partnerships, leading to two successful campaign launches.",
        "Managed contracts and applications for 210+ merchants across 24 banks.",
        "Compiled transaction data and internal reports; supported investigations for customer service issues."
      ]
    }
  ],

  "extraExperience": [
    {
      "title": "Intern, Global Banking",
      "company": "Citibank N.A",
      "location": "Hanoi, Vietnam",
      "years": "Summer 2012",
      "responsibilities": [
        "Supported market research on SMEs and competitors.",
        "Assisted loan contract processing and ensured documentation confidentiality."
      ]
    },
    {
      "title": "Intern, Deputy General Secretary Office",
      "company": "Vietnam Bond Market Association",
      "location": "Hanoi, Vietnam",
      "years": "Summer 2012",
      "responsibilities": [
        "Drafted website content and translated market data reports.",
        "Participated in resume screening and performed general administrative support."
      ]
    },
    {
      "title": "Administrative & Events Assistant",
      "company": "Institute of International Education",
      "location": "Hanoi, Vietnam",
      "years": "Jun 2009 – Apr 2011",
      "responsibilities": [
        "Advised students on U.S. college applications and standardized testing.",
        "Organized education fairs and information sessions for over 50 schools."
      ]
    }
  ]
}