{
  "workExperience": [
    {
      "title": "Geospatial Analyst",
      "company": "Caslys Consulting Ltd.",
      "location": "Lethbridge, AB, Canada",
      "years": "02/2022 - 01/2025",
      "responsibilities": [
        "Developed and implemented geospatial solutions for problems such as land cover mapping, change detection, wildfire risk assessment, surface water dynamics mapping, and crop field segmentation.",
        "Assisted the preparation of proposals and client consultation.",
        "Led R&D initiatives to advance the company's RS capabilities.",
        "Trained junior professionals with new geospatial technologies."
      ]
    },
    {
      "title": "Sessional Instructor",
      "company": "University of Calgary",
      "location": "Calgary, AB, Canada",
      "years": "Fall-2022; Fall-2024",
      "responsibilities": [
        "Developed materials and taught Introduction to Remote Sensing (ENGO435) and Geospatial Data Analytics (ENGG461/661)."
      ]
    },
    {
      "title": "Remote Sensing Scientist",
      "company": "Farmers Edge",
      "location": "Lethbridge, AB, Canada",
      "years": "07/2021 - 02/2022",
      "responsibilities": [
        "Identified tillage practices using time series imagery from Sentinel-2 and Planet Scope."
      ]
    },
    {
      "title": "Postdoctoral Research Associate",
      "company": "University of Calgary",
      "location": "Calgary, AB, Canada",
      "years": "07/2019 - 07/2021",
      "responsibilities": [
        "Leveraged Sentinel-2 time series to map precise canola yields, and investigated how marginal habitats contribute to enhancing and stabilizing crop productivity."
      ]
    },
    {
      "title": "Graduate Research Assistant",
      "company": "South Dakota State University",
      "location": "Brookings, SD, USA",
      "years": "01/2015 - 07/2019",
      "responsibilities": [
        "Developed multi-temporal land cover mapping and change detection methods to quantify the conversion of mixed-grass prairie into agricultural land in South Dakota from 2008 to 2018.",
        "Leveraged AMSR-E/AMSR-2 and QuikSCAT microwave datasets to analyze urban dynamics of major cities across Northern America."
      ]
    },
    {
      "title": "GIS Analyst 1",
      "company": "Rahall Transportation Institute",
      "location": "Huntington, WV, USA",
      "years": "10/2010 - 05/2014",
      "responsibilities": [
        "Contributed to various geospatial data management and analysis tasks, e.g., developing land-use master plans for reclaimed mining sites, geocoding business addresses, digitizing tax parcels."
      ]
    }
  ]
}
